<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"f447698fa240574c67c6fd22a58cf36f09db196e9400d6e694d062e2ef134c08","plan_job_ref":"Job Staging Image Build & Push #43 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7331940880","plan_hash":"c0d93f07161d745104bf39f5a6c93e949a77e606f1ace5c8596f112fc658abc9","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 3 to add, 0 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.fastapi-cluster must be replaced
-/+ resource "aws_ecs_cluster" "fastapi-cluster" {
!~      arn      = "arn:aws:ecs:eu-central-1:806066816337:cluster/dev-fastapi-cluster" -> (known after apply)
!~      id       = "*****************************************************************" -> (known after apply)
!~      name     = "dev-fastapi-cluster" -> "fastapi-cluster" # forces replacement
-       tags     = {} -> null
!~      tags_all = {} -> (known after apply)

#        (1 unchanged block hidden)
    }

  # aws_ecs_service.fastapi-service must be replaced
-/+ resource "aws_ecs_service" "fastapi-service" {
!~      cluster                            = "arn:aws:ecs:eu-central-1:806066816337:cluster/dev-fastapi-cluster" # forces replacement -> (known after apply) # forces replacement
-       health_check_grace_period_seconds  = 0 -> null
!~      iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
!~      id                                 = "*************************************************************************************" -> (known after apply)
        name                               = "dev-fastapi-service"
!~      platform_version                   = "LATEST" -> (known after apply)
-       propagate_tags                     = "NONE" -> null
-       tags                               = {} -> null
!~      tags_all                           = {} -> (known after apply)
!~      task_definition                    = "dev-fastapi-container:4" -> (known after apply)
!~      triggers                           = {
-           "redeployment" = "2023-12-26T15:09:26Z"
        } -> (known after apply)
#        (9 unchanged attributes hidden)

-       deployment_circuit_breaker {
-           enable   = false -> null
-           rollback = false -> null
        }

-       deployment_controller {
-           type = "ECS" -> null
        }

#        (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.task_definition will be created
+   resource "aws_ecs_task_definition" "task_definition" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   cpu          = 1024
+                   essential    = true
+                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:latest"
+                   memory       = 2048
+                   name         = "dev_FastAPI_definition"
+                   portMappings = [
+                       {
+                           containerPort = 5000
+                           hostPort      = 5000
                        },
                    ]
                },
            ]
        )
+       cpu                      = "1024"
+       family                   = "dev-fastapi-container"
+       id                       = (known after apply)
+       memory                   = "2048"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = (known after apply)
    }

  # aws_ecs_task_definition.task_definition_1 will be destroyed
  # (because aws_ecs_task_definition.task_definition_1 is not in configuration)
-   resource "aws_ecs_task_definition" "task_definition_1" {
-       arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:4" -> null
-       arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> null
-       container_definitions    = jsonencode(
            [
-               {
-                   cpu          = 1024
-                   environment  = []
-                   essential    = true
-                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:latest"
-                   memory       = 2048
-                   mountPoints  = []
-                   name         = "dev_FastAPI_definition"
-                   portMappings = [
-                       {
-                           containerPort = 5000
-                           hostPort      = 5000
-                           protocol      = "tcp"
                        },
                    ]
-                   volumesFrom  = []
                },
            ]
        ) -> null
-       cpu                      = "1024" -> null
-       family                   = "dev-fastapi-container" -> null
-       id                       = "dev-fastapi-container" -> null
-       memory                   = "2048" -> null
-       network_mode             = "awsvpc" -> null
-       requires_compatibilities = [
-           "FARGATE",
        ] -> null
-       revision                 = 4 -> null
-       skip_destroy             = false -> null
-       tags                     = {} -> null
-       tags_all                 = {} -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #43](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7331940880)